КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ГруппыДоступа/КонтурЛогистика_ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ГруппыДоступа</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВсеПользователи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступКМеханизмам</name>
    <attributes>
      <name>ВидМеханизма</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ВидыМеханизмов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоПросмотр</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданиеРедактирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступКСправочникам</name>
    <attributes>
      <name>ИмяСправочника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоПросмотр</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданиеРедактирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступКТитулам</name>
    <attributes>
      <name>ТипЛогистика</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоПросмотр</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СозданиеРедактирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеОрганизации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь1С</name>
      <type>
        <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ГруппыДоступа/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СоздатьГруппуДоступаСПолнымиПравами() Экспорт
	
	ЭлементГруппыСПолнымиПравами = НайтиПоНаименованию(ИмяГруппыСПолнымиПравами(), Истина);
	Если ЗначениеЗаполнено(ЭлементГруппыСПолнымиПравами) Тогда
		Возврат;
	КонецЕсли;
	
	// Не нашли, создадим новую
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.Наименование = ИмяГруппыСПолнымиПравами();
	НовыйЭлемент.ВсеПользователи = Истина;
	НовыйЭлемент.Записать();
	
КонецПроцедуры

Функция ДоступыПользователя(Пользователь1С) Экспорт
	
	ДоступыПользователя = Новый Структура;
	ДоступыПользователя.Вставить("ПолныйДоступ", Ложь);
	ДоступыПользователя.Вставить("ДоступКСправочникам", МанифестДоступаКОбъекту());
	ДоступыПользователя.Вставить("ДоступКТитулам", МанифестДоступаКОбъекту());
	ДоступыПользователя.Вставить("ДоступКМеханизмам", МанифестДоступаКОбъекту());
	
	// Глобальная настройка
	ИспользоватьГруппыДоступа = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьГруппыДоступа");
	Если Не ИспользоватьГруппыДоступа Тогда
		ДоступыПользователя.ПолныйДоступ = Истина;
		Возврат ДоступыПользователя;
	КонецЕсли;
	
	ЗаполнитьШаблонДоступыПользователя(ДоступыПользователя);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь1С", Пользователь1С);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ГруппыДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ГруппыДоступа КАК КонтурЛогистика_ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ГруппыДоступа.Пользователи КАК КонтурЛогистика_ГруппыДоступаПользователи
	|		ПО КонтурЛогистика_ГруппыДоступа.Ссылка = КонтурЛогистика_ГруппыДоступаПользователи.Ссылка
	|ГДЕ
	|	НЕ КонтурЛогистика_ГруппыДоступа.ЭтоГруппа
	|	И НЕ КонтурЛогистика_ГруппыДоступа.ПометкаУдаления
	|	И КонтурЛогистика_ГруппыДоступа.Наименование = ""&ИмяГруппыСПолнымиПравами""
	|	И (КонтурЛогистика_ГруппыДоступа.ВсеПользователи
	|			ИЛИ КонтурЛогистика_ГруппыДоступаПользователи.Пользователь1С = &Пользователь1С)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ГруппыДоступа.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ГруппыДоступа
	|ИЗ
	|	Справочник.КонтурЛогистика_ГруппыДоступа КАК КонтурЛогистика_ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ГруппыДоступа.Пользователи КАК КонтурЛогистика_ГруппыДоступаПользователи
	|		ПО КонтурЛогистика_ГруппыДоступа.Ссылка = КонтурЛогистика_ГруппыДоступаПользователи.Ссылка
	|ГДЕ
	|	НЕ КонтурЛогистика_ГруппыДоступа.ЭтоГруппа
	|	И НЕ КонтурЛогистика_ГруппыДоступа.ПометкаУдаления
	|	И КонтурЛогистика_ГруппыДоступа.Наименование <> ""&ИмяГруппыСПолнымиПравами""
	|	И (КонтурЛогистика_ГруппыДоступаПользователи.Пользователь1С = &Пользователь1С
	|			ИЛИ КонтурЛогистика_ГруппыДоступа.ВсеПользователи)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ГруппыДоступаДоступКСправочникам.ИмяСправочника КАК ИмяСправочника,
	|	МАКСИМУМ(КонтурЛогистика_ГруппыДоступаДоступКСправочникам.ТолькоПросмотр) КАК ТолькоПросмотр,
	|	МАКСИМУМ(КонтурЛогистика_ГруппыДоступаДоступКСправочникам.СозданиеРедактирование) КАК СозданиеРедактирование
	|ИЗ
	|	ГруппыДоступа КАК ГруппыДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ГруппыДоступа.ДоступКСправочникам КАК КонтурЛогистика_ГруппыДоступаДоступКСправочникам
	|		ПО ГруппыДоступа.Ссылка = КонтурЛогистика_ГруппыДоступаДоступКСправочникам.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ГруппыДоступаДоступКСправочникам.ИмяСправочника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ГруппыДоступаДоступКТитулам.ТипЛогистика КАК ТипЛогистика,
	|	МАКСИМУМ(КонтурЛогистика_ГруппыДоступаДоступКТитулам.ТолькоПросмотр) КАК ТолькоПросмотр,
	|	МАКСИМУМ(КонтурЛогистика_ГруппыДоступаДоступКТитулам.СозданиеРедактирование) КАК СозданиеРедактирование
	|ИЗ
	|	ГруппыДоступа КАК ГруппыДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ГруппыДоступа.ДоступКТитулам КАК КонтурЛогистика_ГруппыДоступаДоступКТитулам
	|		ПО ГруппыДоступа.Ссылка = КонтурЛогистика_ГруппыДоступаДоступКТитулам.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ГруппыДоступаДоступКТитулам.ТипЛогистика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ГруппыДоступаДоступКМеханизмам.ВидМеханизма КАК ВидМеханизма,
	|	МАКСИМУМ(КонтурЛогистика_ГруппыДоступаДоступКМеханизмам.ТолькоПросмотр) КАК ТолькоПросмотр,
	|	МАКСИМУМ(КонтурЛогистика_ГруппыДоступаДоступКМеханизмам.СозданиеРедактирование) КАК СозданиеРедактирование
	|ИЗ
	|	ГруппыДоступа КАК ГруппыДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ГруппыДоступа.ДоступКМеханизмам КАК КонтурЛогистика_ГруппыДоступаДоступКМеханизмам
	|		ПО ГруппыДоступа.Ссылка = КонтурЛогистика_ГруппыДоступаДоступКМеханизмам.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ГруппыДоступаДоступКМеханизмам.ВидМеханизма";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяГруппыСПолнымиПравами", ИмяГруппыСПолнымиПравами());
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Полные права
	Если Не Результат[0].Пустой() Тогда
		ДоступыПользователя.ПолныйДоступ = Истина;
		Возврат ДоступыПользователя;
	КонецЕсли;
	
	// Справочники
	ВыборкаДоступКСправочникам = Результат[2].Выбрать();
	Пока ВыборкаДоступКСправочникам.Следующий() Цикл
		ДобавитьДоступыПоВыборке(ДоступыПользователя.ДоступКСправочникам, ВыборкаДоступКСправочникам, "ИмяСправочника");
	КонецЦикла;
	
	// Титулы
	ВыборкаДоступКТитулам = Результат[3].Выбрать();
	Пока ВыборкаДоступКТитулам.Следующий() Цикл
		ДобавитьДоступыПоВыборке(ДоступыПользователя.ДоступКТитулам, ВыборкаДоступКТитулам, "ТипЛогистика");
	КонецЦикла;
	
	// Механизмы
	ВыборкаДоступМеханизмам = Результат[4].Выбрать();
	Пока ВыборкаДоступМеханизмам.Следующий() Цикл
		ДобавитьДоступыПоВыборке(ДоступыПользователя.ДоступКМеханизмам, ВыборкаДоступМеханизмам, "ВидМеханизма");
	КонецЦикла;
	
	Возврат ДоступыПользователя;
	
КонецФункции

Функция ДоступныеОрганизации(Пользователь1С) Экспорт
	
	ДоступныеОрганизации = Новый Структура;
	ДоступныеОрганизации.Вставить("ПолныйДоступ", Ложь);
	ДоступныеОрганизации.Вставить("Организации", Новый Массив);
	
	// Глобальная настройка
	ИспользоватьГруппыДоступа = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьГруппыДоступа");
	Если Не ИспользоватьГруппыДоступа Тогда
		ДоступныеОрганизации.ПолныйДоступ = Истина;
		Возврат ДоступныеОрганизации;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь1С", ПараметрыСеанса.ТекущийПользователь);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ГруппыДоступа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_ГруппыДоступа КАК КонтурЛогистика_ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ГруппыДоступа.Пользователи КАК КонтурЛогистика_ГруппыДоступаПользователи
	|		ПО КонтурЛогистика_ГруппыДоступа.Ссылка = КонтурЛогистика_ГруппыДоступаПользователи.Ссылка
	|ГДЕ
	|	НЕ КонтурЛогистика_ГруппыДоступа.ЭтоГруппа
	|	И НЕ КонтурЛогистика_ГруппыДоступа.ПометкаУдаления
	|	И (КонтурЛогистика_ГруппыДоступа.Наименование = ""&ИмяГруппыСПолнымиПравами""
	|			ИЛИ КонтурЛогистика_ГруппыДоступа.ВсеОрганизации)
	|	И (КонтурЛогистика_ГруппыДоступа.ВсеПользователи
	|			ИЛИ КонтурЛогистика_ГруппыДоступаПользователи.Пользователь1С = &Пользователь1С)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ГруппыДоступа.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ГруппыДоступа
	|ИЗ
	|	Справочник.КонтурЛогистика_ГруппыДоступа КАК КонтурЛогистика_ГруппыДоступа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ГруппыДоступа.Пользователи КАК КонтурЛогистика_ГруппыДоступаПользователи
	|		ПО КонтурЛогистика_ГруппыДоступа.Ссылка = КонтурЛогистика_ГруппыДоступаПользователи.Ссылка
	|ГДЕ
	|	НЕ КонтурЛогистика_ГруппыДоступа.ЭтоГруппа
	|	И НЕ КонтурЛогистика_ГруппыДоступа.ПометкаУдаления
	|	И КонтурЛогистика_ГруппыДоступа.Наименование <> ""&ИмяГруппыСПолнымиПравами""
	|	И НЕ КонтурЛогистика_ГруппыДоступа.ВсеОрганизации
	|	И (КонтурЛогистика_ГруппыДоступа.ВсеПользователи
	|			ИЛИ КонтурЛогистика_ГруппыДоступаПользователи.Пользователь1С = &Пользователь1С)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтурЛогистика_ГруппыДоступаДоступныеОрганизации.Организация КАК Организация
	|ИЗ
	|	ГруппыДоступа КАК ГруппыДоступа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтурЛогистика_ГруппыДоступа.ДоступныеОрганизации КАК КонтурЛогистика_ГруппыДоступаДоступныеОрганизации
	|		ПО ГруппыДоступа.Ссылка = КонтурЛогистика_ГруппыДоступаДоступныеОрганизации.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтурЛогистика_ГруппыДоступаДоступныеОрганизации.Организация";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяГруппыСПолнымиПравами", ИмяГруппыСПолнымиПравами());
	
	Результат = Запрос.ВыполнитьПакет();
	
	// Полные права или все организации
	Если Не Результат[0].Пустой() Тогда
		ДоступныеОрганизации.ПолныйДоступ = Истина;
		Возврат ДоступныеОрганизации;
	КонецЕсли;
	
	// Организации
	ДоступныеОрганизации.Организации = Результат[2].Выгрузить().ВыгрузитьКолонку("Организация");
	
	Возврат ДоступныеОрганизации;
	
КонецФункции

Функция ПереченьДоступныхСправочников() Экспорт
	
	Перечень = Новый Массив;
	Перечень.Добавить("КонтурЛогистика_ГорючеСмазочныеМатериалы");
	Перечень.Добавить("КонтурЛогистика_Договоры");
	Перечень.Добавить("КонтурЛогистика_Лицензии");
	Перечень.Добавить("КонтурЛогистика_ОрганизацииДиадок");
	Перечень.Добавить("КонтурЛогистика_ПодразделенияДиадок");
	Перечень.Добавить("КонтурЛогистика_ПунктыМаршрута");
	Перечень.Добавить("КонтурЛогистика_Сотрудники");
	Перечень.Добавить("КонтурЛогистика_ТранспортныеСредства");
	
	Возврат Перечень;
	
КонецФункции

Функция ИмяГруппыСПолнымиПравами() Экспорт
	
	Возврат "Полный доступ";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МанифестДоступаКОбъекту()
	
	Манифест = Новый Структура;
	Манифест.Вставить("ТолькоПросмотр", Новый Соответствие);
	Манифест.Вставить("СозданиеРедактирование", Новый Соответствие);
	
	Возврат Манифест;
	
КонецФункции

Процедура ЗаполнитьШаблонДоступыПользователя(ДоступыПользователя)
	
	// Справочники
	Перечень = ПереченьДоступныхСправочников();
	Для Каждого ТекущаяСтрока Из Перечень Цикл
		ДоступыПользователя.ДоступКСправочникам.ТолькоПросмотр.Вставить(ТекущаяСтрока, Ложь);
		ДоступыПользователя.ДоступКСправочникам.СозданиеРедактирование.Вставить(ТекущаяСтрока, Ложь);
	КонецЦикла;
	
	// Титулы
	ВсеТипы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ВсеТипыЛогистическихДокументов();
	Для Каждого ТекущийТип Из ВсеТипы Цикл
		ДоступыПользователя.ДоступКТитулам.ТолькоПросмотр.Вставить(ТекущийТип, Ложь);
		ДоступыПользователя.ДоступКТитулам.СозданиеРедактирование.Вставить(ТекущийТип, Ложь);
	КонецЦикла;
	
	// Механизмы
	ВсеВидыМеханизмов = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ВсеВидыМеханизмов();
	Для Каждого ТекущийВид Из ВсеВидыМеханизмов Цикл
		ДоступыПользователя.ДоступКМеханизмам.ТолькоПросмотр.Вставить(ТекущийВид, Ложь);
		ДоступыПользователя.ДоступКМеханизмам.СозданиеРедактирование.Вставить(ТекущийВид, Ложь);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьДоступыПоВыборке(Доступы, Выборка, ИмяДанных)
	
	Если Выборка.СозданиеРедактирование Тогда
		Доступы.СозданиеРедактирование.Вставить(Выборка[ИмяДанных], Истина);
	ИначеЕсли Выборка.ТолькоПросмотр Тогда
		Доступы.ТолькоПросмотр.Вставить(Выборка[ИмяДанных], Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
